--1.
SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
FROM "Н_ЛЮДИ"
         LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" = 'Александрович'
  AND "Н_ВЕДОМОСТИ"."ДАТА" > '1998-01-05'
  AND "Н_ВЕДОМОСТИ"."ДАТА" < '1998-01-05';

--2.
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."ГРУППА", "Н_ОБУЧЕНИЯ"."НЗК"
FROM "Н_ЛЮДИ"
         LEFT JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         LEFT JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" > 'Сергеевич'
  AND "Н_ОБУЧЕНИЯ"."НЗК" = '933232';

--3.
SELECT count(*)
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE "НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)'
  AND ("Н_ЛЮДИ"."ОТЧЕСТВО" = '.'
    OR "Н_ЛЮДИ"."ОТЧЕСТВО" IS NULL);

--4.
SELECT "ПЛАН_ИД"
FROM (SELECT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД","ГРУППА"
      FROM "Н_ГРУППЫ_ПЛАНОВ"
               JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
               JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
          AND "КОРОТКОЕ_ИМЯ" = 'КТиУ')
         AS "ГРУППЫ_КТиУ"
GROUP BY "ПЛАН_ИД"
HAVING COUNT(*) > 2;

--5.
SELECT "Н_УЧЕНИКИ"."ИД",
       "ФАМИЛИЯ",
       "ИМЯ",
       "ОТЧЕСТВО",
       "ГРУППА",
       AVG(CAST("ОЦЕНКА" AS INT)) as avg_mark
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
  AND "ОЦЕНКА" IN ('2', '3', '4', '5')
GROUP BY "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА"
HAVING AVG(CAST("ОЦЕНКА" AS INT)) > (SELECT MAX(CAST("ОЦЕНКА" AS INT)) AS max_mark
                                     FROM (SELECT "ОЦЕНКА"
                                           FROM "Н_УЧЕНИКИ"
                                                    JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                                                    JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                           WHERE "ГРУППА" = '3100'
                                             AND "ОЦЕНКА" IN ('2', '3', '4', '5')
                                          ) AS group_3100);

--6.
SELECT "ГРУППА", "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "П_ПРКОК_ИД" ,"СОСТОЯНИЕ"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
    AND "Н_УЧЕНИКИ"."СОСТОЯНИЕ" = 'утвержден'
    AND DATE("НАЧАЛО") < '2012-09-01')
  AND "КУРС" = '1'
  AND "ФО_ИД" IN (SELECT "ИД"
                  FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                  WHERE "НАИМЕНОВАНИЕ" = 'Заочная')
  AND "НАПС_ИД" IN (SELECT "ИД"
                    FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
                    WHERE "НС_ИД" IN (SELECT "ИД"
                                      FROM "Н_НАПР_СПЕЦ"
                                      WHERE "НАИМЕНОВАНИЕ" = 'Программная инженерия'));

--7.
SELECT *
FROM "Н_ЛЮДИ"
WHERE "Н_ЛЮДИ"."ИД" not in (
    SELECT "ЧЛВК_ИД"
    FROM "Н_УЧЕНИКИ"
             JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
             JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
    WHERE "Н_ОТДЕЛЫ"."ИД" IN (WITH RECURSIVE "ПОДОТДЕЛЫ_ИТМО" AS (
        SELECT "ИД",
               "ОТД_ИД"
        FROM "Н_ОТДЕЛЫ"
        WHERE "КОРОТКОЕ_ИМЯ" = 'СПбГУИТМО'

        UNION

        SELECT "Н_ОТДЕЛЫ"."ИД",
               "Н_ОТДЕЛЫ"."ОТД_ИД"
        FROM "Н_ОТДЕЛЫ"
                 JOIN "ПОДОТДЕЛЫ_ИТМО" ON "ПОДОТДЕЛЫ_ИТМО"."ИД" = "Н_ОТДЕЛЫ"."ОТД_ИД")
                              SELECT "ИД"
                              FROM "ПОДОТДЕЛЫ_ИТМО"));



--------------------------------------------------------------------------------------------------------
CREATE SEQUENCE user_id_seq
    INCREMENT BY 1
    START WITH 1
    MAXVALUE 1000
    NO CYCLE;

SELECT NEXTVAL('user_id_seq');
SELECT CURRVAL('user_id_seq');
SELECT LASTVAL('user_id_seq');