--Получить список студентов
--зачисленных до первого сентября 2012 года (2012-09-01) -> ОК
--на первый курс -> ОК
--заочной формы обучения -> ОК
--(специальность: Программная инженерия) -> ОК

--заочной формы обучения
SELECT "ГРУППА", "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ФО_ИД"
FROM "Н_УЧЕНИКИ"
    JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ФО_ИД" IN (SELECT "ИД"
                 FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                 WHERE "НАИМЕНОВАНИЕ" = 'Заочная');

--специальность: Программная инженерия
SELECT "ГРУППА", "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ФО_ИД"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "НАПС_ИД" IN (SELECT "ИД"
                 FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
                 WHERE "НС_ИД" IN (SELECT "ИД"
                                  FROM "Н_НАПР_СПЕЦ"
                                  WHERE "НАИМЕНОВАНИЕ" = 'Программная инженерия'));

--на первый курс
SELECT "ГРУППА", "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "КУРС"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "КУРС" = '1';

--зачисленных до первого сентября 2012 года (2012-09-01)
SELECT "ГРУППА", "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "П_ПРКОК_ИД" ,"СОСТОЯНИЕ"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
    AND "Н_УЧЕНИКИ"."СОСТОЯНИЕ" = 'утвержден'
    AND DATE("НАЧАЛО") < '2012-09-01');



-- Объединим все что написано выше
SELECT "ГРУППА", "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "П_ПРКОК_ИД" ,"СОСТОЯНИЕ"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
    AND "Н_УЧЕНИКИ"."СОСТОЯНИЕ" = 'утвержден'
    AND DATE("НАЧАЛО") < '2012-09-01')
  AND "КУРС" = '1'
  AND "ФО_ИД" IN (SELECT "ИД"
                  FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                  WHERE "НАИМЕНОВАНИЕ" = 'Заочная')
  AND "НАПС_ИД" IN (SELECT "ИД"
                    FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
                    WHERE "НС_ИД" IN (SELECT "ИД"
                                      FROM "Н_НАПР_СПЕЦ"
                                      WHERE "НАИМЕНОВАНИЕ" = 'Программная инженерия'));