--SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ПЛАНЫ"."ФО_ИД"
-- С помощью соединения таблиц
SELECT count(*)
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE "НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)'
  AND ("Н_ЛЮДИ"."ОТЧЕСТВО" = '.'
    OR "Н_ЛЮДИ"."ОТЧЕСТВО" IS NULL);

-- С помощью подзапросов
SELECT count(*)
FROM "Н_УЧЕНИКИ"
WHERE "ПЛАН_ИД" IN (Select "ИД"
                   FROM "Н_ПЛАНЫ"
                   WHERE "ФО_ИД" IN (SELECT "ИД"
                                    FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                                    WHERE "НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)'))
AND "ЧЛВК_ИД" IN (SELECT "ИД"
                 FROM "Н_ЛЮДИ"
                 WHERE "ОТЧЕСТВО" = '.')