-----------------------------------------------------------------------------------------
--------------------------- Найдём макс оценку в группе 3100 ----------------------------
-----------------------------------------------------------------------------------------
    --Найдём все оценки в группе 3100, кроме зачёта
    SELECT "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА", CAST("ОЦЕНКА" AS INT)
    FROM "Н_УЧЕНИКИ"
        JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
        JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    WHERE "ГРУППА" = '3100'
      AND "ОЦЕНКА" IN ('2', '3', '4', '5');

    --Теперь найдём макс оценку в группе
    SELECT MAX("ОЦЕНКА") AS max_mark
    FROM (SELECT "ОЦЕНКА"
          FROM "Н_УЧЕНИКИ"
              JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
              JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
          WHERE "ГРУППА" = '3100'
            AND "ОЦЕНКА" IN ('2', '3', '4', '5'))
        AS group_3100;


-----------------------------------------------------------------------------------------
------------------- Составим таблицу со средними оценками группы 4100 -------------------
-----------------------------------------------------------------------------------------

SELECT "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА", AVG(CAST("ОЦЕНКА" AS INT))
FROM "Н_УЧЕНИКИ"
    JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
  AND "ОЦЕНКА" IN ('2', '3', '4', '5')
GROUP BY "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА";

-----------------------------------------------------------------------------------------
----------------------- Объединим все запросы выше в один запрос ------------------------
-----------------------------------------------------------------------------------------

WITH max_mark_3100 AS (
    SELECT MAX(CAST("ОЦЕНКА" AS INT)) AS max_mark
    FROM (SELECT "ОЦЕНКА"
          FROM "Н_УЧЕНИКИ"
              JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
              JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
          WHERE "ГРУППА" = '3100'
            AND "ОЦЕНКА" IN ('2', '3', '4', '5')
    ) AS group_3100
)
SELECT "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА", AVG(CAST("ОЦЕНКА" AS INT)) as avg_mark
FROM "Н_УЧЕНИКИ"
    JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
  AND "ОЦЕНКА" IN ('2', '3', '4', '5')
GROUP BY "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА"
HAVING AVG(CAST("ОЦЕНКА" AS INT)) > (SELECT max_mark FROM max_mark_3100);


-----------------------------------------------------------------------------------------
----------------------- Альтернатива без использования переменных -----------------------
-----------------------------------------------------------------------------------------

SELECT "Н_УЧЕНИКИ"."ИД",
       "ФАМИЛИЯ",
       "ИМЯ",
       "ОТЧЕСТВО",
       "ГРУППА",
       AVG(CAST("ОЦЕНКА" AS INT)) as avg_mark
FROM "Н_УЧЕНИКИ"
    JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
  AND "ОЦЕНКА" IN ('2', '3', '4', '5')
GROUP BY "Н_УЧЕНИКИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "ГРУППА"
HAVING AVG(CAST("ОЦЕНКА" AS INT)) > (SELECT MAX(CAST("ОЦЕНКА" AS INT)) AS max_mark
                                     FROM (SELECT "ОЦЕНКА"
                                           FROM "Н_УЧЕНИКИ"
                                               JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                                               JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                           WHERE "ГРУППА" = '3100'
                                             AND "ОЦЕНКА" IN ('2', '3', '4', '5')
                                          ) AS group_3100);

-----------------------------------------------------------------------------------------